<a href="https://colab.research.google.com/github/npr99/PlanningMethods/blob/master/Location_Quotient_Using_BLS_QCEW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Location Quotient Example Using BLS QCEW

The Bureau of Labor Statistics provides employment and wage data by year, county, state, and nation by industry.

An overview of this data is available on the BLS website for the Quarterly Census of Employment and Wages (QCEW) data

https://www.bls.gov/cew/

The BLS provides data in "data slices" - for individual states and counties.

https://data.bls.gov/cew/doc/access/csv_data_slices.htm

The BLS provides a complete layout of the datasets - specifically for Location Quotient the Annual Average data is a good choice:

https://data.bls.gov/cew/doc/access/csv_data_slices.htm#ANNUAL_LAYOUT

The BLS provides a complete list of Areas (states and counties) - the "area codes" are based on the state and county FIPS codes:

https://data.bls.gov/cew/doc/titles/area/area_titles.htm

### Example Area Slice Files

2016 QCEW Annual averages for Georgia
http://data.bls.gov/cew/data/api/2016/a/area/13000.csv

2016 QCEW Annual averages for Chatham County, GA
http://data.bls.gov/cew/data/api/2016/a/area/13051.csv

### File Layout
https://www.bls.gov/cew/about-data/downloadable-file-layouts/annual/naics-based-annual-layout.htm

#### Details on codes for different ownership types:
https://www.bls.gov/cew/classifications/ownerships/ownership-titles.htm


Note totals for employment are the sums of all Annual average of monthly employment levels for a given year (annual_avg_emplvl) for all ownership codes.

### BLS data as time series
Chatham County QCEW Time Series Data
https://data.bls.gov/timeseries/ENU1305110010

## Step 1: Obtain BLS QCEW Data File
The Pandas read csv command is a fast way to download .csv datafiles directly to the notebook session.

In [2]:
import pandas as pd # For reading, writing and wrangling data

In [3]:
blsqcew_areatitles = pd.read_csv('https://data.bls.gov/cew/doc/titles/area/area_titles.csv')
blsqcew_areatitles.head()

  area_fips                                      area_title
0     US000                                      U.S. TOTAL
1     USCMS      U.S. Combined Statistical Areas (combined)
2     USMSA  U.S. Metropolitan Statistical Areas (combined)
3     USNMS   U.S. Nonmetropolitan Area Counties (combined)
4     01000                            Alabama -- Statewide

In [14]:
# Find Area FIPS code based on county name
blsqcew_areatitles.loc[blsqcew_areatitles['area_title'] == 'Chatham County, Georgia']

    area_fips               area_title
486     13051  Chatham County, Georgia

In [15]:
# Save Area Title for later use
area_title_df = blsqcew_areatitles.loc[blsqcew_areatitles['area_fips'] == '13051']
area_title = area_title_df['area_title'].values[0]
area_title

'Chatham County, Georgia'

In [5]:
blsqcew = pd.read_csv('http://data.bls.gov/cew/data/api/2016/a/area/13051.csv')
blsqcew.head()

   area_fips  own_code  ... oty_avg_annual_pay_chg  oty_avg_annual_pay_pct_chg
0      13051         0  ...                    -35                        -0.1
1      13051         1  ...                    180                         0.3
2      13051         1  ...                    180                         0.3
3      13051         1  ...                  -1971                        -3.2
4      13051         1  ...                   2469                         2.7

[5 rows x 38 columns]

## Step 3: Explore Data
Look at descripitive statistics for key variabiables.

In [23]:
# Explore the Location quotient of annual average employment relative to the U.S. (Rounded to the hundredths place)
blsqcew[['annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages',]].describe()

       annual_avg_estabs  ...  lq_total_annual_wages
count        1703.000000  ...            1703.000000
mean           45.806812  ...               0.771321
std           365.106190  ...               2.100285
min             0.000000  ...               0.000000
25%             2.000000  ...               0.000000
50%             5.000000  ...               0.140000
75%            15.000000  ...               0.950000
max          8654.000000  ...              35.960000

[8 rows x 4 columns]

# Look at top Location Quotients by industry

## Full list of industry codes
For a full list of industry codes use the link below:

https://www.bls.gov/cew/classifications/industry/industry-titles.htm


## More details on NAICS
North American Industry Classification System (NAICS) 

https://www.naics.com/search/

## NAICS FAQ
https://www.naics.com/frequently-asked-questions/#NAICSfaq

## Add Industry Titles

In [25]:
industry_titles_df = pd.read_csv('https://www.bls.gov/cew/classifications/industry/industry-titles-csv.csv')
industry_titles_df.head()

  industry_code                     industry_title
0            10           10 Total, all industries
1           101                101 Goods-producing
2          1011  1011 Natural resources and mining
3          1012                  1012 Construction
4          1013                 1013 Manufacturing

In [32]:
industry_titles_df.industry_code.describe()

count      2497
unique     2497
top       42449
freq          1
Name: industry_code, dtype: object

In [34]:
blsqcew_titles = pd.merge(left = industry_titles_df,
                          right = blsqcew,
                          left_on = 'industry_code',
                          right_on = 'industry_code',
                          how = 'right')
blsqcew_titles.head()

  industry_code  ... oty_avg_annual_pay_pct_chg
0            10  ...                       -0.1
1            10  ...                        0.3
2            10  ...                        5.8
3            10  ...                        1.4
4            10  ...                       -0.4

[5 rows x 39 columns]

In [35]:
blsqcew_titles.industry_code.describe()

count     1703
unique    1549
top         10
freq         5
Name: industry_code, dtype: object

In [36]:
blsqcew_titles[['industry_title','annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages']].sort_values(by='lq_annual_avg_emplvl', ascending=False).head(10)

                                         industry_title  ...  lq_total_annual_wages
1090                 NAICS 488320 Marine cargo handling  ...                  35.96
1089                  NAICS 48832 Marine cargo handling  ...                  35.96
1086  NAICS 4883 Support activities for water transp...  ...                  26.33
104   NAICS 621493 Freestanding emergency medical ce...  ...                  26.21
1071  NAICS 4871 Scenic and sightseeing transportati...  ...                  14.20
1072  NAICS 48711 Scenic and sightseeing transportat...  ...                  14.20
1073  NAICS 487110 Scenic and sightseeing transporta...  ...                  14.20
235        NAICS 62142 Outpatient mental health centers  ...                  14.10
237       NAICS 621420 Outpatient mental health centers  ...                  14.10
1091      NAICS 48833 Navigational services to shipping  ...                  10.45

[10 rows x 5 columns]

Look at top industries by employement.

In [37]:
blsqcew_titles[['industry_title','annual_avg_estabs','annual_avg_emplvl','lq_annual_avg_emplvl','lq_total_annual_wages']].sort_values(by='annual_avg_emplvl', ascending=False).head(10)

                                  industry_title  ...  lq_total_annual_wages
0                       10 Total, all industries  ...                   1.00
4                       10 Total, all industries  ...                   1.01
8                          102 Service-providing  ...                   0.92
11     1021 Trade, transportation, and utilities  ...                   1.26
21                  1026 Leisure and hospitality  ...                   1.48
19            1025 Education and health services  ...                   1.29
1577    NAICS 72 Accommodation and food services  ...                   1.72
303                          101 Goods-producing  ...                   1.38
95    NAICS 62 Health care and social assistance  ...                   1.26
26                      NAICS 44-45 Retail trade  ...                   1.24

[10 rows x 5 columns]

Look at summary data by 2-digit NAICS code and Ownership Code.

In [39]:
blsqcew_2digit = blsqcew_titles[['industry_code','industry_title','own_code','annual_avg_estabs','annual_avg_emplvl']].\
loc[(blsqcew_titles['industry_code'].str.len()==2) |
    (blsqcew_titles['industry_code'].str.contains("-"))].sort_values(by=['industry_code','own_code'])
blsqcew_2digit.head()

  industry_code            industry_title  ...  annual_avg_estabs  annual_avg_emplvl
0            10  10 Total, all industries  ...               8654             149090
1            10  10 Total, all industries  ...                 64               2603
2            10  10 Total, all industries  ...                 49               4774
3            10  10 Total, all industries  ...                 16              10917
4            10  10 Total, all industries  ...               8527             130796

[5 rows x 5 columns]

In [40]:
#  Need to drop total covered - own_code == 0 - leads to double counting
blsqcew_2digit = blsqcew_2digit.loc[(blsqcew['own_code'] !=0)]
blsqcew_2digit.head()

    industry_code  ... annual_avg_emplvl
1              10  ...              2603
2              10  ...              4774
3              10  ...             10917
4              10  ...            130796
308            11  ...                 0

[5 rows x 5 columns]

In [42]:
# Replace Industry code for NAICS 92 to get levels of government
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92')]

    industry_code  ... annual_avg_emplvl
125            92  ...              1403
126            92  ...              1912
127            92  ...              5346

[3 rows x 5 columns]

In [43]:
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==1),'industry_code'] = '92 1 Federal Government'
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==2),'industry_code'] = '92 2 State Government'
blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==3),'industry_code'] = '92 3 Local Government'

In [50]:
table1 = blsqcew_2digit.groupby(by=["industry_code","industry_title"]).sum()
table1.reset_index(inplace = True)
table_title = "Two-digit NAICS, "+area_title
varformat = {('annual_avg_emplvl'): "{:,.0f}", ('annual_avg_estabs'):"{:,.0f}"}
table1.style\
     .set_caption(table_title)\
     .format(varformat)

# Create a function that obtains and cleans BLS data

In [59]:
import pandas as pd # For reading, writing and wrangling data
import sys  # saving CSV files

def obtain_clean_bls(area_fips: str = "US000", year: str = "2016"):
  """
  area_fips = 5 character string
  """
  blsqcew_areatitles = pd.read_csv('https://data.bls.gov/cew/doc/titles/area/area_titles.csv')
  blsqcew = pd.read_csv('http://data.bls.gov/cew/data/api/'+year+'/a/area/'+area_fips+'.csv')
  
  # Save Area Title for later use
  area_title_df = blsqcew_areatitles.loc[blsqcew_areatitles['area_fips'] == area_fips]
  area_title = area_title_df['area_title'].values[0]

  # Add industry titles
  industry_titles_df = pd.read_csv('https://www.bls.gov/cew/classifications/industry/industry-titles-csv.csv')
  blsqcew_titles = pd.merge(left = industry_titles_df,
                            right = blsqcew,
                            left_on = 'industry_code',
                            right_on = 'industry_code',
                            how = 'right')
  
  # Look at summary data by 2-digit NAICS code and Ownership Code
  blsqcew_2digit = blsqcew_titles[['industry_code','industry_title','own_code','annual_avg_estabs','annual_avg_emplvl']].\
  loc[(blsqcew_titles['industry_code'].str.len()==2) |
      (blsqcew_titles['industry_code'].str.contains("-"))].sort_values(by=['industry_code','own_code'])

  #  Need to drop total covered - own_code == 0 - leads to double counting
  blsqcew_2digit = blsqcew_2digit.loc[(blsqcew['own_code'] !=0)]

  # Replace Industry code for NAICS 92 to get levels of government
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                   (blsqcew_2digit['own_code'] ==1),'industry_code'] = '92 1 Federal Government'
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                    (blsqcew_2digit['own_code'] ==2),'industry_code'] = '92 2 State Government'
  blsqcew_2digit.loc[(blsqcew_2digit['industry_code'] =='92') &
                    (blsqcew_2digit['own_code'] ==3),'industry_code'] = '92 3 Local Government'

  table1 = blsqcew_2digit.groupby(by=["industry_code","industry_title"]).sum()
  table1.reset_index(inplace = True)
  table_title = "Two-digit NAICS, "+area_title
  varformat = {('annual_avg_emplvl'): "{:,.0f}", ('annual_avg_estabs'):"{:,.0f}"}
  table1_fmt = table1.style\
      .set_caption(table_title)\
      .format(varformat)

  # renanme columns 
  
  # Save results as csv
  csv_filepath = 'BLSQCEW_'+year+"_"+area_fips+'.csv'
  savefile = csv_filepath
  print(savefile)
  table1.to_csv(savefile, index=False)

  return table1_fmt

obtain_clean_bls()

BLSQCEW_2016_US000.csv